#pragma once 
#include "GameField.h" // Підключення заголовочного файлу для роботи з ігровим полем

#define MIN_BOARD_SIZE 3 // Мінімальний розмір ігрового поля
#define MAX_BOARD_SIZE 9 // Максимальний розмір ігрового поля

// Структура для керування ігровим процесом
struct GameController
{
	GameField field; // Змінна, що зберігає всі елементи стурктури GameField
	int moveCount; // Змінна для підрахунку кількості ходів, зроблених гравцем
	void StartGame(); // Прототип функції, необхідної для початку гри
	
	int InputControling(std::string input); // Прототип функції, необхідної для обробки введення користувача
	
	void GameLoop(); // Прототип функції, необхідного для основного циклу гри, де відбувається логіка гри
};