#include <iostream> // Підключення стандартної бібліотеки для вводу/виводу
#include <iomanip> // Підключення бібліотеки для форматування виводу
#include <string> // Підключення бібліотеки для роботи з рядками 
#include "GameField.h" // Підключення заголовочного файлу для роботи з ігровим полем

void GameField::InitialField(int size) // Визначення функції для ініціалізації ігрового поля
{
	d = size; // Встановлення розміру поля 

    field = new int* [d]; // Виділення пам'яті під масив рядків
	for (int i = 0; i < d; i++) // Оператор циклу for, виділення пам'яті під кожен рядок
    {
        field[i] = new int[d];
    }

    int value = d * d - 1; // Початкове значення для заповнення поля

	for (int i = 0; i < d; i++) // Оператор циклу for, прохід по кожному рядку матриці
    {
		for (int j = 0; j < d; j++) // Оператор циклу for, прохід по кожному стовпцю матриці
        {
			if (i == d - 1 && j == d - 1) // Умовний оператор if, якщо це остання клітинка, вона буде іеіціалізуватися як порожня
            {
				field[i][j] = 0; // Встановлення значення 0 для порожньої клітинки  
				empty.x = i; // Збереження координат порожньої клітинки
				empty.y = j; // Збереження координат порожньої клітинки
            }
			else // Інакше 
            {
				field[i][j] = value; // Заповнення клітинки поточним значенням
				value--; // Зменшення значення для наступної клітинки
            }
        }
    }
	if (d % 2 == 0) // Умовний оператор if, якщо розмір поля парний, потрібно змінити місцями 1 і 2 для забезпечення розв'язності головоломки
    {
        int tmp = field[d-1][d-2];
		field[d - 1][d - 2] = field[d - 1][d - 3];
		field[d - 1][d - 3] = tmp;
    }
	status = Active; // Встановлення статусу гри як активного
}

std::ostream& operator<<(std::ostream& out, const GameField& var) // Визначення функції для перевизначення оператора виводу (бінарного зсуву) для зручного виведення стану ігрового поля на екран
{
    out << " " << std::string(var.d * 7 - 1, '-') << std::endl;
	for (int i = 0; i < var.d; i++) // Оператор циклу for, прохід по кожному рядку матриці
    {
        
		for (int j = 0; j < var.d; j++) // Оператор циклу for, прохід по кожному стовпцю матриці
        {
            out << "| ";

			if (i == var.empty.x && j == var.empty.y) // Умовний оператор if, якщо це порожня клітинка, виводиться підкреслення
            {
                out << std::setw(4) << "_";
            }
			else // Інакше виводиться значення клітинки
            {
                out << std::setw(4) << var.field[i][j];
            }

            out << " ";
        }
        out << "|" << std::endl;
		if (i != var.d - 1) // Умовний оператор if, якщо це не останній ряд, виводиться роздільник між рядками
        {
            out << "| " << std::string(var.d * 7 - 2, '-') << "|" << std::endl;
        }
        else 
        {
            out << " " << std::string(var.d * 7 - 1, '-') << std::endl;
        }
    }
	return out; // Повернення потока виводу для можливості ланцюжкового виклику оператора виводу
}

bool GameField::IsCorrectMove(int x, int y) // Визначення функції для перевірки можливості ходу
{
	if (x <= d - 1 && y <= d - 1 && x >= 0 && y >= 0) // Умовний оператор if, перевірка на те, що вказані координати знаходяться в межах поля
    {
		if ((x == empty.x && (y == empty.y - 1 || y == empty.y + 1)) || (y == empty.y && (x == empty.x - 1 || x == empty.x + 1))) // Умовний оператор if, перевірка на те, що вказані координати знаходяться в сусідстві з порожньою клітинкою (по горизонталі або вертикалі)
        {
			return true; // Повернення true, якщо хід можливий
		}
		else // Інакше
        {
			return false; // Повернення false, якщо хід неможливий, так як клітинка не межує з порожньою
		}
    }
	else // Інакше
    {
		return false; // Повернення false, якщо хід неможливий, так як координати виходять за межі поля
    }
}

bool GameField::operator += (int number) // Визначення функції для перевизначення оператора += для виконання ходу
{
	int inx = -1, jny = -1; // Ініціалізація змінних для зберігання координат клітинки, яку потрібно перемістити 
	bool found = false; // Ініціалізація змінної для відстеження, чи знайдена клітинка з вказаним номером
	for (int i = 0; i < d; i++) // Оператор циклу for, прохід по кожному рядку матриці
    {
		for (int j = 0; j < d; j++) // Оператор циклу for, прохід по кожному стовпцю матриці
        {
			if (number == field[i][j]) // Умовний оператор if, якщо знайдено клітинку з вказаним номером то її координати зберігаються 
            {
				inx = i; // Збереження координати x клітинки для переміщення 
				jny = j; // Збереження координати y клітинки для переміщення
				found = true; // Встановлення флага, що клітинка знайдена
				break; // Вихід з внутрішнього циклу після знаходження клітинки
            }
        }
		if (found) // Умовний оператор if, якщо клітинка з вказаним номером знайдена, то вихід з зовнішнього циклу
        {

			break; // Вихід з зовнішнього циклу після знаходження клітинки
        }
    }
	if (!found) // Умовний оператор if, якщо клітинка з вказаним номером не знайдена
    {
        throw(std::logic_error("[ПОМИЛКА] - Неможливий хід! Введене число виходить за допустимі межі розміру ігрового поля!")); // Генерування виключення
    }
   
	if (IsCorrectMove(inx, jny)) // Умовний оператор if, якщо хід можливий, то виконується переміщення клітинки
    {
		// Обмін значень між порожньою клітинкою і клітинкою, яку потрібно перемістити
		field[empty.x][empty.y] = field[inx][jny]; 
        field[inx][jny] = 0; 
        empty.x = inx; 
		empty.y = jny;
		return true; // Повернення true, якщо хід виконано успішно
    }
    else // Інакше
    {
		throw(std::logic_error("[ПОМИЛКА] - Неможливий хід! Введене число не межує з порожньою клітинкою!")); // Генерування виключення
    }
}

bool GameField::IsGameOver() // Визначення функції для перевірки умови завершення гри
{
	if (!(empty.x == d - 1 && empty.y == d - 1)) // Умовний оператор if, якщо порожня клітинка не знаходиться в останній позиції, гра вважається не завершеною
    {
		return false; // Повернення false
    }
	for (int i = 0; i < d; i++) // Оператор циклу for, прохід по кожному рядку матриці
    {
		for (int j = 0; j < d; j++) // Оператор циклу for, прохід по кожному стовпцю матриці
        {
			if (i == d - 1 && j == d - 1) // Умовний оператор if, якщо це остання клітинка, вона пропускається, так як вона порожня і не повинна містити число
            {
				continue; // Пропуск ітерації для останньої клітинки
            }
			if (field[i][j] != i * d + j + 1) // Умовний оператор if, якщо значення клітинок не відповідає правильному порядку, гра вважається не завершеною
            {
				return false; // Повернення false
            }    
		}
    }
	return true; // Поверненння true
}
