#pragma once

// Структура для зберігання стану ігрового поля
struct GameField 
{
	int d; // Розмір поля (d x d)
	int** field; // Двовимірний масив для зберігання значень на полі
	struct EmptyPoint // Структура для зберігання координат порожньої клітинки 
	{ 
		int x; // Координата x порожньої клітинки
		int y; // Координата y порожньої клітинки
	} empty; 
	enum GameStatus // Структура для зберігання статусу гри
	{
		Active, // 0 - гра активна
		Win, // 1 - гравець виграв
		UserInterrupted // 2 - користувач перервав гру
	} status;

	void InitialField(int size); // Прототип функції для ініціалізації ігрового поля

	void PrintField(); // Прототип функції для виведення ігрового поля на екран
	
	bool IsCorrectMove(int x, int y) // Прототип функції для перевірки можливості ходу
	{
		return true;
	}
	void MakeMove(int i, int j) // Прототип функції для виконання ходу
	{
	}
	bool IsGameOver() // Прототип функції для перевірки умвои завершення гри
	{
		return false;
	}
};
