#include <iostream> // Підключення стандартної бібліотеки для вводу/виводу
#include <iomanip> // Підключення бібліотеки для форматування виводу
#include <string> // Підключення бібліотеки для роботи з рядками 
#include "GameField.h" // Підключення заголовочного файлу для роботи з ігровим полем

void GameField::InitialField(int size) // Визначення функції для ініціалізації ігрового поля
{
	d = size; // Встановлення розміру поля 

    field = new int* [d]; // Виділення пам'яті під масив рядків
	for (int i = 0; i < d; i++) // Оператор циклу for, виділення пам'яті під кожен рядок
    {
        field[i] = new int[d];
    }

    int value = d * d - 1; // Початкове значення для заповнення поля

	for (int i = 0; i < d; i++) // Оператор циклу for, прохід по кожному рядку матриці
    {
		for (int j = 0; j < d; j++) // Оператор циклу for, прохід по кожному стовпцю матриці
        {
			if (i == d - 1 && j == d - 1) // Умовний оператор if, якщо це остання клітинка, вона буде іеіціалізуватися як порожня
            {
				field[i][j] = 0; // Встановлення значення 0 для порожньої клітинки  
				empty.x = i; // Збереження координат порожньої клітинки
				empty.y = j; // Збереження координат порожньої клітинки
            }
			else // Інакше 
            {
				field[i][j] = value; // Заповнення клітинки поточним значенням
				value--; // Зменшення значення для наступної клітинки
            }
        }
    }
	if (d % 2 == 0) // Умовний оператор if, якщо розмір поля парний, потрібно змінити місцями 1 і 2 для забезпечення розв'язності головоломки
    {
        int tmp = field[d-1][d-2];
		field[d - 1][d - 2] = field[d - 1][d - 3];
		field[d - 1][d - 3] = tmp;
    }
	status = Active; // Встановлення статусу гри як активного
}

void GameField::PrintField() // Визначення функції для виведення ігрового поля на екран
{
	for (int i = 0; i < d; i++) // Оператор циклу for, прохід по кожному рядку матриці
    {
        std::cout << std::string(d * 8, '-') << std::endl;
		for (int j = 0; j < d; j++) // Оператор циклу for, прохід по кожному стовпцю матриці
        {
            std::cout << "| ";

			if (i == empty.x && j == empty.y) // Умовний оператор if, якщо це порожня клітинка, виводиться підкреслення
            {
                std::cout << std::setw(4) << "_";
            }
			else // Інакше виводиться значення клітинки
            {
                std::cout << std::setw(4) << field[i][j];
            }

            std::cout << " ";
        }
        std::cout << "|" << std::endl;
    }
    std::cout << std::string(d * 8, '-') << std::endl;
}