// main.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream> // Підключення стандартної бібліотеки для вводу/виводу
#include <Windows.h> // Підключення бібліотеки для роботи з консоллю (для встановлення кодування)
#include "GameField.h" // Підключення заголовочного файлу для роботи з ігровим полем
#include "GameController.h" // Підключення заголовочного файлу для керування ігровим процесом

int main() // Головна функція, точка входу в програму
{
	SetConsoleOutputCP(65001); // Встановлення кодування UTF-8 для виводу в консоль
	SetConsoleCP(65001); // Встановлення кодування UTF-8 для вводу з консолі

	GameField field; // Ініціалізація змінної для зберігання стану ігрового поля
	int size = 10; 

	if (size < MIN_BOARD_SIZE || size > MAX_BOARD_SIZE) // Умовний оператор if, перевірка на допустимість розміру поля
	{
		std::cout << "[УВАГА] - Розмір поля повинен бути в межах від " << MIN_BOARD_SIZE << " до " << MAX_BOARD_SIZE << "!" << std::endl;
		return 1; // Завершення програми з кодом помилки
	}

	field.InitialField(size); // Ініціалізація ігрового поля з вказаним розміром
	field.PrintField(); // Виведення початкового стану ігрового поля на екран

	int x = 1, y = 2;
	int step = 2;

	if (field.IsCorrectMove(x, y)) // Умовний оператор if, перевірка на можливість ходу за вказаними координатами
	{
		std::cout << "[УВАГА] - При обраних координатах (i = " << x << "; j = " << y << ") хід фішки можливий!\n" << "Обрана клітинка для руху: №" << step << std::endl;
		
		if (field.MakeMove(step)) // Умовний оператор if, якщо хід виконано успішно, то виводиться оновлене поле і перевіряється умова завершення гри
		{
			std::cout << "Хід виконано!\nОновлене поле:" << std::endl;

			field.PrintField(); // Виведення оновленого стану ігрового поля на екран
			std::cout << "Перевірка на завершення гри... " << std::endl;

			if (field.IsGameOver()) // Умовний оператор if, якщо умвови завершення гри виконані, то виводиться повідомлення про перемогу
			{
				std::cout << "[УВАГА] - Гра завершена! Вітаємо з перемогою!" << std::endl;
			}

			else // Інакше, якщо гра ще не завершена, виводиться повідомлення про продовження гри
			{
				std::cout << "[УВАГА] - Гра продовжується. Зробіть наступний хід!" << std::endl;
			}
		}
		else // Інакше, якщо хід не виконано, виводиться повідомлення про неможливість ходу
		{
			std::cout << "[УВАГА] - Хід здійснити неможливо: клітинка з координатами (i = " << x << "; j = " << y << ")\n(Спробуйте вказати інші координати клітинки, вона має межувати з порожньою і не виходити за межі ігрового поля!)" << std::endl;
		}
	}
	else // Інакше, якщо хід за вказаними координатами неможливий, виводиться повідомлення про неможливість ходу
	{
		std::cout << "[УВАГА] - Хід здійснити неможливо: клітинка з координатами (i = " << x << "; j = " << y << ")\n(Спробуйте вказати інші координати клітинки, вона має межувати з порожньою і не виходити за межі ігрового поля!)" << std::endl;
	}
	for (int i = 0; i < size; i++)
	{
		delete[] field.field[i]; // Звільнення пам'яті, виділеної для кожного рядка ігрового поля
	}
	delete[] field.field; // Звільнення пам'яті, виділеної для масиву рядків ігрового поля

	return 0; // Завершення програми з кодом успішного виконання
}